app/controllers/places_controller.rb

  def index
        @places = Place.all
        unless
        @places = Place.search(params[:kind], params[:location_id])
---
SELECT "places".* FROM "places"
SELECT "places".* FROM "places"  WHERE "places"."kind" = 1

  def create
    @place = current_admin_user.places.build(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("admin_user_id", "budget_id", "created_at", "kind", "location_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["admin_user_id", 2], ["budget_id", 1], ["created_at", "2014-07-16 03:25:12.055168"], ["kind", 1], ["location_id", 1], ["name", "1"], ["updated_at", "2014-07-16 03:25:12.055168"]]

  def update
    respond_to do |format|
      if @place.update(place_params)
---
UPDATE "places" SET "image_file_name" = ?, "image_updated_at" = ?, "kind" = ?, "location_id" = ?, "updated_at" = ? WHERE "places"."id" = 28  [["image_file_name", "IMG_3832.JPG"], ["image_updated_at", "2014-07-17 16:16:04.903947"], ["kind", 2], ["location_id", 2], ["updated_at", "2014-07-17 16:16:08.478851"]]