app/controllers/trips_controller.rb

INSERT INTO "trips" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-06-09 21:19:40.474717"], ["description", "trip 1"], ["updated_at", "2014-06-09 21:19:40.474717"]]
---
  def create
    @trip = Trip.new(trip_params)

    respond_to do |format|
      if @trip.save